Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
    snapshot_flash_region(
        sim,
        STM32F429_BOOTLOADER_BASE,
        protected_stage0_before,
        sizeof(protected_stage0_before)
    );
    snapshot_flash_region(
        sim,
        active->signed_image_base,
        protected_slot_before,
        sizeof(protected_slot_before)
    );
    snapshot_flash_region(
        sim,
        STM32F429_RECOVERY_BASE,
        protected_recovery_before,
        sizeof(protected_recovery_before)
    );
}

static void expect_protected_regions_unchanged(
    const simulated_flash_t *sim,
    const boot_slot_descriptor_t *active
)
{
    expect_flash_region_unchanged(
        "Stage 0",
        sim,
        STM32F429_BOOTLOADER_BASE,
        protected_stage0_before,
        sizeof(protected_stage0_before)
    );
    expect_flash_region_unchanged(
        "active slot",
        sim,
        active->signed_image_base,
        protected_slot_before,
        sizeof(protected_slot_before)
    );
    expect_flash_region_unchanged(
        "recovery region",
        sim,
        STM32F429_RECOVERY_BASE,
        protected_recovery_before,
        sizeof(protected_recovery_before)
    );
}

static uint32_t count_writes_in_range(
    const simulated_flash_t *sim,
    uint32_t base,
    uint32_t end
)
{
    uint32_t count = 0U;

    for (size_t i = 0U; i < sim->write_log_count; ++i) {
        const simulated_flash_write_log_entry_t *entry = &sim->write_log[i];
        const uint32_t entry_end =
            entry->address + (uint32_t)entry->length;
        if ((entry->address < end) && (entry_end > base)) {
            count += 1U;
        }
    }

    return count;
}

static void test_sector_lookup_and_bounds(void)
{
    boot_flash_sector_t sector;
    simulated_flash_t sim;
    boot_flash_t flash;
    uint32_t base = 0U;
    uint32_t end = 0U;

    make_flash(&sim, &flash);
    expect_status("bounds", BOOT_FLASH_OK, boot_flash_bounds(&flash, &base, &end));
    expect_u32("flash base", STM32F429_FLASH_BASE, base);
    expect_u32("flash end", STM32F429_FLASH_END, end);

    expect_status("sector 0", BOOT_FLASH_OK, boot_flash_sector_by_id(0U, &sector));
    expect_u32("sector 0 base", 0x08000000UL, sector.base);
    expect_u32("sector 0 end", 0x08004000UL, sector.end);

    expect_status("sector 5", BOOT_FLASH_OK, boot_flash_sector_by_id(5U, &sector));
    expect_u32("sector 5 base", STM32F429_SLOT_A_SIGNED_IMAGE_BASE, sector.base);
    expect_u32("sector 5 size", 0x00020000UL, sector.size);

    expect_status("sector 12", BOOT_FLASH_OK, boot_flash_sector_by_id(12U, &sector));
    expect_u32("sector 12 base", STM32F429_SLOT_B_SIGNED_IMAGE_BASE, sector.base);
    expect_u32("sector 12 size", 0x00004000UL, sector.size);

    expect_status("sector 23", BOOT_FLASH_OK, boot_flash_sector_by_id(23U, &sector));
    expect_u32("sector 23 base", STM32F429_RECOVERY_BASE, sector.base);
    expect_u32("sector 23 end", STM32F429_FLASH_END, sector.end);

    expect_status(
        "invalid sector",
        BOOT_FLASH_ERR_INVALID_ARGUMENT,
        boot_flash_sector_by_id(24U, &sector)
    );
}

static void test_allowed_erase_policy(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;

    make_flash(&sim, &flash);

    expect_status(
        "erase metadata A",
        BOOT_FLASH_OK,
        boot_flash_erase_sector(&flash, STM32F429_BOOT_METADATA_A_FIRST_SECTOR)
    );
    expect_status(
        "erase update metadata",
        BOOT_FLASH_OK,
        boot_flash_erase_sector(&flash, STM32F429_UPDATE_METADATA_FIRST_SECTOR)
    );
    expect_status(
        "erase inactive slot",
        BOOT_FLASH_OK,
        boot_flash_erase_sector(&flash, STM32F429_SLOT_B_FIRST_SECTOR)
    );
    expect_status(
        "erase stage0 rejected",
        BOOT_FLASH_ERR_PROTECTED_REGION,
        boot_flash_erase_sector(&flash, STM32F429_BOOTLOADER_FIRST_SECTOR)
    );
    expect_status(
        "erase active slot rejected",
        BOOT_FLASH_ERR_PROTECTED_REGION,
        boot_flash_erase_sector(&flash, STM32F429_SLOT_A_FIRST_SECTOR)
    );
    expect_status(
        "erase recovery rejected",
        BOOT_FLASH_ERR_PROTECTED_REGION,
        boot_flash_erase_sector(&flash, STM32F429_RECOVERY_FIRST_SECTOR)
    );
    expect_u32("only allowed erases reached backend", 3U, sim.erase_count);
    expect_u32("last erase was inactive slot", STM32F429_SLOT_B_FIRST_SECTOR, sim.last_erase_sector);
}

static void test_target_flash_stub_fails_closed(void)
{
    boot_flash_t flash;
    uint8_t data[8] = {0U};
    uint8_t output[8];

    expect_status(
        "target stub init",
        BOOT_FLASH_OK,
        boot_flash_target_init_disabled(&flash)
    );
    expect_status(
        "target stub read disabled",
        BOOT_FLASH_ERR_BACKEND,
        boot_flash_read(&flash, STM32F429_FLASH_BASE, output, sizeof(output))
    );
    expect_status(
        "target stub erase protected",
        BOOT_FLASH_ERR_PROTECTED_REGION,
        boot_flash_erase_sector(&flash, STM32F429_BOOT_METADATA_A_FIRST_SECTOR)
    );
    expect_status(
        "target stub program protected",
        BOOT_FLASH_ERR_PROTECTED_REGION,
        boot_flash_program_aligned(&flash, STM32F429_BOOT_METADATA_A_BASE, data, sizeof(data))
    );
}

static void test_program_alignment_bounds_and_readback(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    uint8_t data[16];
    uint8_t erased_bytes[16];
    uint8_t readback[16];

    for (size_t i = 0U; i < sizeof(data); ++i) {
        data[i] = (uint8_t)(0xA0U + i);
        erased_bytes[i] = 0xFFU;
    }

    make_flash(&sim, &flash);

    expect_status(
        "program unaligned address",
        BOOT_FLASH_ERR_ALIGNMENT,
        boot_flash_program_aligned(
            &flash,
            STM32F429_SLOT_B_SIGNED_IMAGE_BASE + 1UL,
            data,
            sizeof(data)
        )
    );
    expect_status(
        "program unaligned length",
        BOOT_FLASH_ERR_ALIGNMENT,
        boot_flash_program_aligned(&flash, STM32F429_SLOT_B_SIGNED_IMAGE_BASE, data, 9U)
    );
    expect_status(
        "program active slot rejected",
        BOOT_FLASH_ERR_PROTECTED_REGION,
        boot_flash_program_aligned(&flash, STM32F429_SLOT_A_SIGNED_IMAGE_BASE, data, sizeof(data))
    );
    expect_status(
        "program out of bounds",
        BOOT_FLASH_ERR_OUT_OF_BOUNDS,
        boot_flash_program_aligned(&flash, STM32F429_FLASH_END - 8UL, data, sizeof(data))
    );
    expect_status(
        "program address overflow",
        BOOT_FLASH_ERR_OUT_OF_BOUNDS,
        boot_flash_program_aligned(&flash, UINT32_MAX - 7UL, data, sizeof(data))
    );
    expect_u32("rejected programs did not reach backend", 0U, sim.program_count);

    expect_status(
        "program inactive slot",
        BOOT_FLASH_OK,
        boot_flash_program_aligned(&flash, STM32F429_SLOT_B_SIGNED_IMAGE_BASE, data, sizeof(data))
    );
    memset(readback, 0, sizeof(readback));
    expect_status(
        "read inactive slot",
        BOOT_FLASH_OK,
        boot_flash_read(&flash, STM32F429_SLOT_B_SIGNED_IMAGE_BASE, readback, sizeof(readback))
    );
    if (memcmp(data, readback, sizeof(data)) != 0) {
        printf("readback data mismatch\n");
        failures += 1;
    }

    expect_u32("first programmed address", STM32F429_SLOT_B_SIGNED_IMAGE_BASE, sim.last_program_address);
    expect_u32("first programmed length", (uint32_t)sizeof(data), (uint32_t)sim.last_program_length);

    expect_status(
        "program 0-to-1 rejected",
        BOOT_FLASH_ERR_BACKEND,
        boot_flash_program_aligned(
            &flash,
            STM32F429_SLOT_B_SIGNED_IMAGE_BASE,
            erased_bytes,
            sizeof(erased_bytes)
        )
    );
}

static void test_read_rejects_address_overflow_before_backend(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    uint8_t data[16];

