Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
    make_flash(&sim, &flash);
    expect_status(
        "read address overflow",
        BOOT_FLASH_ERR_OUT_OF_BOUNDS,
        boot_flash_read(&flash, UINT32_MAX - 7UL, data, sizeof(data))
    );
    expect_u32("overflow read did not reach backend", 0U, sim.read_count);
}

static void test_readback_verification_failure_is_reported(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    uint8_t data[8] = {0x11U, 0x22U, 0x33U, 0x44U, 0x55U, 0x66U, 0x77U, 0x88U};

    make_flash(&sim, &flash);
    simulated_flash_corrupt_after_program(&sim, 1U);
    expect_status(
        "program verify detects corruption",
        BOOT_FLASH_ERR_VERIFY,
        boot_flash_program_aligned(&flash, STM32F429_BOOT_METADATA_A_BASE, data, sizeof(data))
    );
}

static void test_failure_injection_is_visible(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    uint8_t data[8] = {0U};

    make_flash(&sim, &flash);
    simulated_flash_fail_after(&sim, 1U);
    expect_status(
        "erase failure injection",
        BOOT_FLASH_ERR_BACKEND,
        boot_flash_erase_sector(&flash, STM32F429_BOOT_METADATA_A_FIRST_SECTOR)
    );
    expect_u32("erase attempted once", 1U, sim.erase_count);

    make_flash(&sim, &flash);
    simulated_flash_fail_after(&sim, 1U);
    expect_status(
        "program failure injection",
        BOOT_FLASH_ERR_BACKEND,
        boot_flash_program_aligned(&flash, STM32F429_BOOT_METADATA_A_BASE, data, sizeof(data))
    );
    expect_u32("program attempted once", 1U, sim.program_count);
}

static void test_flash_init_rejects_invalid_policy(void)
{
    boot_flash_t flash;
    simulated_flash_t sim;
    const boot_flash_region_t bad_region[] = {
        {STM32F429_FLASH_END, STM32F429_FLASH_END + 8UL},
    };

    simulated_flash_init(&sim);
    expect_status(
        "bad alignment",
        BOOT_FLASH_ERR_INVALID_ARGUMENT,
        boot_flash_init(&flash, &sim, simulated_flash_ops(), write_regions, 1U, 7U)
    );
    expect_status(
        "bad write region",
        BOOT_FLASH_ERR_OUT_OF_BOUNDS,
        boot_flash_init(&flash, &sim, simulated_flash_ops(), bad_region, 1U, 8U)
    );
}

static boot_metadata_record_t metadata_empty_record(void)
{
    boot_metadata_record_t record;
    expect_metadata_status(
        "empty metadata",
        BOOT_METADATA_OK,
        boot_metadata_empty(&record)
    );
    return record;
}

static boot_metadata_record_t metadata_confirmed(
    const boot_metadata_record_t *current,
    uint32_t slot,
    uint32_t version
)
{
    boot_metadata_record_t next;
    expect_metadata_status(
        "prepare confirmed",
        BOOT_METADATA_OK,
        boot_metadata_prepare_next(
            current,
            BOOT_METADATA_STATE_CONFIRMED,
            slot,
            BOOT_SLOT_NONE,
            version,
            0U,
            1U,
            0U,
            &next
        )
    );
    return next;
}

static boot_metadata_record_t metadata_writing(
    const boot_metadata_record_t *current,
    uint32_t active_slot,
    uint32_t candidate_slot,
    uint32_t version
)
{
    boot_metadata_record_t next;
    expect_metadata_status(
        "prepare writing",
        BOOT_METADATA_OK,
        boot_metadata_prepare_next(
            current,
            BOOT_METADATA_STATE_WRITING,
            active_slot,
            candidate_slot,
            version,
            0U,
            0U,
            0U,
            &next
        )
    );
    return next;
}

static void init_update_keys(void)
{
    uint8_t seed[32];

    for (uint32_t i = 0U; i < sizeof(seed); ++i) {
        seed[i] = (uint8_t)(0xA0U + i);
    }

    crypto_ed25519_key_pair(update_secret_key, update_public_key, seed);
}

static void sign_package_manifest(uint8_t *package)
{
    crypto_ed25519_sign(
        &package[SIGNED_MANIFEST_SIZE],
        update_secret_key,
        package,
        SIGNED_MANIFEST_SIZE
    );
}

static void refresh_package_hash_and_signature(uint8_t *package)
{
    signed_manifest_t manifest;
    uint8_t payload_hash[SIGNED_PAYLOAD_HASH_SIZE];

    expect_verify_status(
        "decode package for refresh",
        VERIFY_OK,
        signed_image_decode_manifest(package, &manifest)
    );
    crypto_sha512(
        payload_hash,
        &package[SIGNED_IMAGE_HEADER_SIZE],
        (size_t)manifest.image_size
    );
    memcpy(
        &package[offsetof(signed_manifest_t, payload_sha512)],
        payload_hash,
        sizeof(payload_hash)
    );
    sign_package_manifest(package);
}

static size_t build_update_package_for_slot(
    uint32_t slot_id,
    uint32_t image_version,
    uint8_t *package,
    size_t package_capacity
)
{
    const boot_slot_descriptor_t *slot = NULL;
    uint8_t *payload = NULL;
    uint8_t payload_hash[SIGNED_PAYLOAD_HASH_SIZE];
    const size_t package_size =
        (size_t)SIGNED_IMAGE_HEADER_SIZE + TEST_UPDATE_PAYLOAD_SIZE;

    expect_u32(
        "package buffer capacity",
        1U,
        (package_capacity >= package_size) ? 1U : 0U
    );
    expect_u32(
        "lookup package slot",
        BOOT_SLOT_LOOKUP_OK,
        boot_slot_lookup(slot_id, &slot)
    );

    memset(package, 0xFF, package_size);
    payload = &package[SIGNED_IMAGE_HEADER_SIZE];
    memset(payload, 0xA5, TEST_UPDATE_PAYLOAD_SIZE);
    test_store_le32(&payload[0], APPLICATION_MSP_END);
    test_store_le32(&payload[4], slot->payload_base | 1UL);
    crypto_sha512(payload_hash, payload, TEST_UPDATE_PAYLOAD_SIZE);

    test_store_le32(&package[offsetof(signed_manifest_t, magic)], SIGNED_IMAGE_MAGIC);
    test_store_le32(
        &package[offsetof(signed_manifest_t, header_version)],
        UPDATE_PACKAGE_FORMAT_VERSION
    );
    test_store_le32(
        &package[offsetof(signed_manifest_t, image_version)],
        image_version
    );
    test_store_le32(
        &package[offsetof(signed_manifest_t, vector_address)],
        slot->payload_base
    );
    test_store_le32(
        &package[offsetof(signed_manifest_t, image_size)],
        TEST_UPDATE_PAYLOAD_SIZE
    );
    test_store_le32(&package[offsetof(signed_manifest_t, flags)], 0U);
    test_store_le32(
        &package[offsetof(signed_manifest_t, reserved0)],
        UPDATE_PACKAGE_TARGET_STM32F429IGT6_AB_V1
    );
    test_store_le32(
        &package[offsetof(signed_manifest_t, reserved1)],
        UPDATE_PACKAGE_IMAGE_TYPE_APPLICATION
    );
    memcpy(
        &package[offsetof(signed_manifest_t, payload_sha512)],
        payload_hash,
        sizeof(payload_hash)
    );
    sign_package_manifest(package);

