Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
    return package_size;
}

static void commit_confirmed_metadata(
    boot_flash_t *flash,
    uint32_t active_slot,
    uint32_t version
)
{
    boot_metadata_record_t empty = metadata_empty_record();
    boot_metadata_record_t confirmed =
        metadata_confirmed(&empty, active_slot, version);

    expect_metadata_status(
        "commit confirmed metadata",
        BOOT_METADATA_OK,
        boot_metadata_commit(flash, &confirmed)
    );
}

static update_install_options_t make_install_options(
    uint8_t *program_buffer,
    uint8_t *readback_buffer,
    uint8_t *installed_buffer,
    update_install_fault_hook_t hook,
    void *hook_context
)
{
    update_install_options_t options;

    options.program_buffer = program_buffer;
    options.program_buffer_size = TEST_INSTALL_PROGRAM_CHUNK;
    options.readback_buffer = readback_buffer;
    options.readback_buffer_size = TEST_INSTALL_PROGRAM_CHUNK;
    options.installed_image_buffer = installed_buffer;
    options.installed_image_buffer_size = TEST_PACKAGE_BUFFER_SIZE;
    options.fault_hook = hook;
    options.fault_context = hook_context;
    return options;
}

typedef struct {
    update_install_fault_point_t point;
    uint32_t detail;
    uint8_t match_detail;
} install_fault_config_t;

static update_install_status_t install_fault_hook(
    void *context,
    update_install_fault_point_t point,
    uint32_t detail
)
{
    const install_fault_config_t *config =
        (const install_fault_config_t *)context;

    if ((config != NULL) &&
        (config->point == point) &&
        ((config->match_detail == 0U) || (config->detail == detail))) {
        return UPDATE_INSTALL_ERR_INJECTED;
    }

    return UPDATE_INSTALL_OK;
}

static size_t setup_standard_install(
    simulated_flash_t *sim,
    boot_flash_t *flash,
    uint32_t active_slot_id,
    uint32_t active_version,
    uint32_t package_version,
    uint8_t *package,
    size_t package_capacity,
    const boot_slot_descriptor_t **active,
    const boot_slot_descriptor_t **candidate
)
{
    make_installer_flash(sim, flash);
    commit_confirmed_metadata(flash, active_slot_id, active_version);

    expect_u32(
        "lookup setup active slot",
        BOOT_SLOT_LOOKUP_OK,
        boot_slot_lookup(active_slot_id, active)
    );
    const uint32_t candidate_slot_id =
        (active_slot_id == (uint32_t)BOOT_SLOT_A)
            ? (uint32_t)BOOT_SLOT_B
            : (uint32_t)BOOT_SLOT_A;
    expect_u32(
        "lookup setup candidate slot",
        BOOT_SLOT_LOOKUP_OK,
        boot_slot_lookup(candidate_slot_id, candidate)
    );

    prepare_protected_snapshots(sim, *active);
    return build_update_package_for_slot(
        candidate_slot_id,
        package_version,
        package,
        package_capacity
    );
}

static void expect_no_forbidden_writes(
    const simulated_flash_t *sim,
    const boot_slot_descriptor_t *active
)
{
    expect_u32("write log did not overflow", 0U, sim->write_log_overflow);
    expect_u32(
        "no Stage 0 writes",
        0U,
        count_writes_in_range(
            sim,
            STM32F429_BOOTLOADER_BASE,
            STM32F429_BOOTLOADER_END
        )
    );
    expect_u32(
        "no active-slot writes",
        0U,
        count_writes_in_range(sim, active->signed_image_base, active->slot_end)
    );
    expect_u32(
        "no recovery writes",
        0U,
        count_writes_in_range(sim, STM32F429_RECOVERY_BASE, STM32F429_RECOVERY_END)
    );
    expect_u32(
        "no update-metadata raw writes",
        0U,
        count_writes_in_range(
            sim,
            STM32F429_UPDATE_METADATA_BASE,
            STM32F429_UPDATE_METADATA_END
        )
    );
}

static void expect_install_failure_invariants(
    const simulated_flash_t *sim,
    const boot_flash_t *flash,
    const boot_slot_descriptor_t *active
)
{
    boot_metadata_record_t recovered;
    boot_metadata_status_t metadata_status =
        boot_metadata_recover_from_flash(flash, &recovered, NULL);

    expect_protected_regions_unchanged(sim, active);
    expect_no_forbidden_writes(sim, active);
    if (metadata_status == BOOT_METADATA_OK &&
        recovered.state == BOOT_METADATA_STATE_CANDIDATE_READY) {
        printf("failed install marked candidate ready\n");
        failures += 1;
    }
}

static void test_metadata_encode_decode_and_recovery(void)
{
    boot_metadata_record_t empty = metadata_empty_record();
    boot_metadata_record_t confirmed =
        metadata_confirmed(&empty, BOOT_SLOT_A, 2U);
    boot_metadata_record_t decoded;
    boot_metadata_record_t selected;
    boot_metadata_recovery_t recovery;
    uint8_t copy_a[STM32F429_BOOT_METADATA_RECORD_SIZE];
    uint8_t copy_b[STM32F429_BOOT_METADATA_RECORD_SIZE];

    expect_metadata_status(
        "encode confirmed",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed, copy_a)
    );
    expect_metadata_status(
        "decode confirmed",
        BOOT_METADATA_OK,
        boot_metadata_decode(copy_a, sizeof(copy_a), &decoded)
    );
    expect_metadata_record(
        "decoded confirmed",
        &decoded,
        1U,
        BOOT_METADATA_STATE_CONFIRMED,
        BOOT_SLOT_A,
        BOOT_SLOT_NONE,
        2U
    );

    memcpy(copy_b, copy_a, sizeof(copy_b));
    copy_b[12] ^= 0x01U;
    expect_metadata_status(
        "corrupt crc rejected",
        BOOT_METADATA_ERR_CRC,
        boot_metadata_decode(copy_b, sizeof(copy_b), &decoded)
    );

    memset(copy_b, 0xFF, sizeof(copy_b));
    expect_metadata_status(
        "recover single copy",
        BOOT_METADATA_OK,
        boot_metadata_recover(copy_a, copy_b, sizeof(copy_a), &selected, &recovery)
    );
    expect_u32("copy A valid", 1U, recovery.copy_a_valid);
    expect_u32("copy B invalid", 0U, recovery.copy_b_valid);
    expect_u32("selected copy A", BOOT_METADATA_COPY_A, recovery.selected_copy);
    expect_metadata_record(
        "selected confirmed",
        &selected,
        1U,
        BOOT_METADATA_STATE_CONFIRMED,
        BOOT_SLOT_A,
        BOOT_SLOT_NONE,
        2U
    );

    boot_metadata_record_t writing =
        metadata_writing(&confirmed, BOOT_SLOT_A, BOOT_SLOT_B, 3U);
    expect_metadata_status(
        "encode writing",
        BOOT_METADATA_OK,
        boot_metadata_encode(&writing, copy_b)
    );
    expect_metadata_status(
        "recover highest sequence",
        BOOT_METADATA_OK,
        boot_metadata_recover(copy_a, copy_b, sizeof(copy_a), &selected, &recovery)
    );
    expect_u32("selected copy B", BOOT_METADATA_COPY_B, recovery.selected_copy);
    expect_metadata_record(
        "selected writing",
        &selected,
        2U,
        BOOT_METADATA_STATE_WRITING,
        BOOT_SLOT_A,
        BOOT_SLOT_B,
        3U
    );

    memset(copy_a, 0xFF, sizeof(copy_a));
    memset(copy_b, 0xFF, sizeof(copy_b));
    expect_metadata_status(
        "both copies invalid",
        BOOT_METADATA_ERR_NO_VALID_COPY,
        boot_metadata_recover(copy_a, copy_b, sizeof(copy_a), &selected, &recovery)
    );
    expect_metadata_record(
        "selected empty after invalid",
        &selected,
        0U,
        BOOT_METADATA_STATE_EMPTY,
        BOOT_SLOT_NONE,
        BOOT_SLOT_NONE,
        0U
    );
}

static void test_metadata_rejects_noncanonical_records(void)
{
    boot_metadata_record_t empty = metadata_empty_record();
    boot_metadata_record_t confirmed =
        metadata_confirmed(&empty, BOOT_SLOT_A, 2U);
    boot_metadata_record_t decoded;
    uint8_t encoded[STM32F429_BOOT_METADATA_RECORD_SIZE];

    expect_metadata_status(
        "encode confirmed for corruption tests",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed, encoded)
    );

    test_store_le32(&encoded[16], 99UL);
    refresh_metadata_crc(encoded);
    expect_metadata_status(
        "decode unknown state rejected",
        BOOT_METADATA_ERR_BAD_FORMAT,
        boot_metadata_decode(encoded, sizeof(encoded), &decoded)
    );

    expect_metadata_status(
        "re-encode confirmed for slot corruption",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed, encoded)
    );
    test_store_le32(&encoded[20], 99UL);
    refresh_metadata_crc(encoded);
    expect_metadata_status(
        "decode invalid active slot rejected",
        BOOT_METADATA_ERR_BAD_FORMAT,
        boot_metadata_decode(encoded, sizeof(encoded), &decoded)
    );

    expect_metadata_status(
        "re-encode confirmed for reserved corruption",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed, encoded)
    );
    test_store_le32(&encoded[44], 1UL);
    refresh_metadata_crc(encoded);
    expect_metadata_status(
        "decode reserved field rejected",
        BOOT_METADATA_ERR_BAD_FORMAT,
        boot_metadata_decode(encoded, sizeof(encoded), &decoded)
    );

    expect_metadata_status(
        "re-encode confirmed for padding corruption",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed, encoded)
    );
    encoded[TEST_METADATA_PADDING_OFFSET] = 1U;
    expect_metadata_status(
        "decode padding rejected",
        BOOT_METADATA_ERR_BAD_FORMAT,
        boot_metadata_decode(encoded, sizeof(encoded), &decoded)
    );

    expect_metadata_status(
        "re-encode confirmed for commit corruption",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed, encoded)
    );
    encoded[TEST_METADATA_COMMIT_OFFSET] ^= 1U;
    expect_metadata_status(
        "decode missing commit marker rejected",
        BOOT_METADATA_ERR_BAD_FORMAT,
        boot_metadata_decode(encoded, sizeof(encoded), &decoded)
    );

    expect_metadata_status(
        "decode truncated metadata rejected",
        BOOT_METADATA_ERR_BAD_FORMAT,
        boot_metadata_decode(
            encoded,
            STM32F429_BOOT_METADATA_RECORD_SIZE - 1U,
            &decoded
        )
    );

