Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
    confirmed.state = (boot_metadata_state_t)99;
    expect_metadata_status(
        "encode unknown state rejected",
        BOOT_METADATA_ERR_BAD_FORMAT,
        boot_metadata_encode(&confirmed, encoded)
    );
}

static void test_metadata_identical_sequence_is_deterministic(void)
{
    boot_metadata_record_t empty = metadata_empty_record();
    boot_metadata_record_t confirmed =
        metadata_confirmed(&empty, BOOT_SLOT_A, 2U);
    boot_metadata_record_t selected;
    boot_metadata_recovery_t recovery;
    uint8_t copy_a[STM32F429_BOOT_METADATA_RECORD_SIZE];
    uint8_t copy_b[STM32F429_BOOT_METADATA_RECORD_SIZE];

    expect_metadata_status(
        "encode identical copy A",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed, copy_a)
    );
    memcpy(copy_b, copy_a, sizeof(copy_b));
    expect_metadata_status(
        "recover identical equal sequence",
        BOOT_METADATA_OK,
        boot_metadata_recover(copy_a, copy_b, sizeof(copy_a), &selected, &recovery)
    );
    expect_u32("identical copy A valid", 1U, recovery.copy_a_valid);
    expect_u32("identical copy B valid", 1U, recovery.copy_b_valid);
    expect_u32("identical selected copy A", BOOT_METADATA_COPY_A, recovery.selected_copy);
    expect_metadata_record(
        "identical selected confirmed",
        &selected,
        1U,
        BOOT_METADATA_STATE_CONFIRMED,
        BOOT_SLOT_A,
        BOOT_SLOT_NONE,
        2U
    );
}

static void test_metadata_ambiguous_and_sequence_handling(void)
{
    boot_metadata_record_t empty = metadata_empty_record();
    boot_metadata_record_t confirmed_a =
        metadata_confirmed(&empty, BOOT_SLOT_A, 2U);
    boot_metadata_record_t confirmed_b = confirmed_a;
    boot_metadata_record_t selected;
    uint8_t copy_a[STM32F429_BOOT_METADATA_RECORD_SIZE];
    uint8_t copy_b[STM32F429_BOOT_METADATA_RECORD_SIZE];

    confirmed_b.active_slot = BOOT_SLOT_B;
    expect_metadata_status(
        "encode confirmed A",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed_a, copy_a)
    );
    expect_metadata_status(
        "encode confirmed B same sequence",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed_b, copy_b)
    );
    expect_metadata_status(
        "same sequence conflict ambiguous",
        BOOT_METADATA_ERR_AMBIGUOUS,
        boot_metadata_recover(copy_a, copy_b, sizeof(copy_a), &selected, NULL)
    );

    empty.sequence = UINT32_MAX - 1UL;
    expect_metadata_status(
        "sequence exhausted",
        BOOT_METADATA_ERR_SEQUENCE,
        boot_metadata_prepare_next(
            &empty,
            BOOT_METADATA_STATE_WRITING,
            BOOT_SLOT_A,
            BOOT_SLOT_B,
            3U,
            0U,
            0U,
            0U,
            &selected
        )
    );
}

static void test_metadata_state_transitions(void)
{
    boot_metadata_record_t empty = metadata_empty_record();
    boot_metadata_record_t confirmed =
        metadata_confirmed(&empty, BOOT_SLOT_A, 2U);
    boot_metadata_record_t writing =
        metadata_writing(&confirmed, BOOT_SLOT_A, BOOT_SLOT_B, 3U);
    boot_metadata_record_t ready;
    boot_metadata_record_t pending;
    boot_metadata_record_t rejected;
    boot_metadata_record_t bad;

    expect_metadata_status(
        "writing to ready",
        BOOT_METADATA_OK,
        boot_metadata_prepare_next(
            &writing,
            BOOT_METADATA_STATE_CANDIDATE_READY,
            BOOT_SLOT_A,
            BOOT_SLOT_B,
            3U,
            0U,
            0U,
            0U,
            &ready
        )
    );
    expect_metadata_status(
        "ready to pending",
        BOOT_METADATA_OK,
        boot_metadata_prepare_next(
            &ready,
            BOOT_METADATA_STATE_PENDING_TRIAL,
            BOOT_SLOT_A,
            BOOT_SLOT_B,
            3U,
            1U,
            0U,
            0U,
            &pending
        )
    );
    expect_metadata_status(
        "pending to rejected",
        BOOT_METADATA_OK,
        boot_metadata_prepare_next(
            &pending,
            BOOT_METADATA_STATE_REJECTED_INVALID,
            BOOT_SLOT_A,
            BOOT_SLOT_B,
            3U,
            0U,
            0U,
            0xBADU,
            &rejected
        )
    );
    expect_metadata_status(
        "confirmed cannot skip to ready",
        BOOT_METADATA_ERR_BAD_TRANSITION,
        boot_metadata_prepare_next(
            &confirmed,
            BOOT_METADATA_STATE_CANDIDATE_READY,
            BOOT_SLOT_A,
            BOOT_SLOT_B,
            3U,
            0U,
            0U,
            0U,
            &bad
        )
    );
    expect_metadata_status(
        "pending requires attempts",
        BOOT_METADATA_ERR_BAD_FORMAT,
        boot_metadata_prepare_next(
            &ready,
            BOOT_METADATA_STATE_PENDING_TRIAL,
            BOOT_SLOT_A,
            BOOT_SLOT_B,
            3U,
            0U,
            0U,
            0U,
            &bad
        )
    );
    expect_metadata_status(
        "same active and candidate rejected",
        BOOT_METADATA_ERR_BAD_FORMAT,
        boot_metadata_prepare_next(
            &confirmed,
            BOOT_METADATA_STATE_WRITING,
            BOOT_SLOT_A,
            BOOT_SLOT_A,
            3U,
            0U,
            0U,
            0U,
            &bad
        )
    );
}

static void test_metadata_flash_commit_and_recovery(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    boot_metadata_record_t empty = metadata_empty_record();
    boot_metadata_record_t confirmed =
        metadata_confirmed(&empty, BOOT_SLOT_A, 2U);
    boot_metadata_record_t writing =
        metadata_writing(&confirmed, BOOT_SLOT_A, BOOT_SLOT_B, 3U);
    boot_metadata_record_t recovered;
    boot_metadata_recovery_t recovery;

    make_flash(&sim, &flash);
    expect_metadata_status(
        "commit initial confirmed",
        BOOT_METADATA_OK,
        boot_metadata_commit(&flash, &confirmed)
    );
    expect_metadata_status(
        "recover initial confirmed",
        BOOT_METADATA_OK,
        boot_metadata_recover_from_flash(&flash, &recovered, &recovery)
    );
    expect_u32("initial selected copy A", BOOT_METADATA_COPY_A, recovery.selected_copy);
    expect_metadata_record(
        "initial recovered",
        &recovered,
        1U,
        BOOT_METADATA_STATE_CONFIRMED,
        BOOT_SLOT_A,
        BOOT_SLOT_NONE,
        2U
    );

    expect_metadata_status(
        "commit writing to alternate copy",
        BOOT_METADATA_OK,
        boot_metadata_commit(&flash, &writing)
    );
    expect_metadata_status(
        "recover writing",
        BOOT_METADATA_OK,
        boot_metadata_recover_from_flash(&flash, &recovered, &recovery)
    );
    expect_u32("writing selected copy B", BOOT_METADATA_COPY_B, recovery.selected_copy);
    expect_metadata_record(
        "writing recovered",
        &recovered,
        2U,
        BOOT_METADATA_STATE_WRITING,
        BOOT_SLOT_A,
        BOOT_SLOT_B,
        3U
    );
}

static void test_metadata_power_loss_during_copy_write_keeps_previous_copy(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    boot_metadata_record_t empty = metadata_empty_record();
    boot_metadata_record_t confirmed =
        metadata_confirmed(&empty, BOOT_SLOT_A, 2U);
    boot_metadata_record_t writing =
        metadata_writing(&confirmed, BOOT_SLOT_A, BOOT_SLOT_B, 3U);
    boot_metadata_record_t recovered;

