Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
    make_flash(&sim, &flash);
    expect_metadata_status(
        "commit initial before failure",
        BOOT_METADATA_OK,
        boot_metadata_commit(&flash, &confirmed)
    );

    simulated_flash_fail_after(&sim, 3U);
    expect_metadata_status(
        "fail during metadata copy 2 erase",
        BOOT_METADATA_ERR_FLASH,
        boot_metadata_commit(&flash, &writing)
    );
    expect_metadata_status(
        "recover confirmed after erase failure",
        BOOT_METADATA_OK,
        boot_metadata_recover_from_flash(&flash, &recovered, NULL)
    );
    expect_metadata_record(
        "confirmed after erase failure",
        &recovered,
        1U,
        BOOT_METADATA_STATE_CONFIRMED,
        BOOT_SLOT_A,
        BOOT_SLOT_NONE,
        2U
    );

    make_flash(&sim, &flash);
    expect_metadata_status(
        "commit initial before body failure",
        BOOT_METADATA_OK,
        boot_metadata_commit(&flash, &confirmed)
    );
    simulated_flash_fail_after(&sim, 4U);
    expect_metadata_status(
        "fail during metadata copy 2 body program",
        BOOT_METADATA_ERR_FLASH,
        boot_metadata_commit(&flash, &writing)
    );
    expect_metadata_status(
        "recover confirmed after body failure",
        BOOT_METADATA_OK,
        boot_metadata_recover_from_flash(&flash, &recovered, NULL)
    );
    expect_metadata_record(
        "confirmed after body failure",
        &recovered,
        1U,
        BOOT_METADATA_STATE_CONFIRMED,
        BOOT_SLOT_A,
        BOOT_SLOT_NONE,
        2U
    );
}

static void test_metadata_uncommitted_record_is_not_selected(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    boot_metadata_record_t empty = metadata_empty_record();
    boot_metadata_record_t confirmed =
        metadata_confirmed(&empty, BOOT_SLOT_A, 2U);
    boot_metadata_record_t writing =
        metadata_writing(&confirmed, BOOT_SLOT_A, BOOT_SLOT_B, 3U);
    boot_metadata_record_t recovered;
    boot_metadata_recovery_t recovery;
    uint8_t encoded[STM32F429_BOOT_METADATA_RECORD_SIZE];

    make_flash(&sim, &flash);
    expect_metadata_status(
        "commit confirmed before uncommitted write",
        BOOT_METADATA_OK,
        boot_metadata_commit(&flash, &confirmed)
    );
    expect_metadata_status(
        "encode uncommitted writing",
        BOOT_METADATA_OK,
        boot_metadata_encode(&writing, encoded)
    );
    expect_status(
        "erase candidate metadata copy",
        BOOT_FLASH_OK,
        boot_flash_erase_sector(&flash, STM32F429_BOOT_METADATA_B_FIRST_SECTOR)
    );
    expect_status(
        "program body without commit marker",
        BOOT_FLASH_OK,
        boot_flash_program_aligned(
            &flash,
            STM32F429_BOOT_METADATA_B_BASE,
            encoded,
            TEST_METADATA_COMMIT_OFFSET
        )
    );
    expect_metadata_status(
        "recover ignores uncommitted copy",
        BOOT_METADATA_OK,
        boot_metadata_recover_from_flash(&flash, &recovered, &recovery)
    );
    expect_u32("uncommitted copy A valid", 1U, recovery.copy_a_valid);
    expect_u32("uncommitted copy B invalid", 0U, recovery.copy_b_valid);
    expect_u32("uncommitted selected copy A", BOOT_METADATA_COPY_A, recovery.selected_copy);
    expect_metadata_record(
        "uncommitted recovered confirmed",
        &recovered,
        1U,
        BOOT_METADATA_STATE_CONFIRMED,
        BOOT_SLOT_A,
        BOOT_SLOT_NONE,
        2U
    );
}

static void test_metadata_commit_failure_boundaries_are_deterministic(void)
{
    for (uint32_t operation = 1U; operation <= 10U; ++operation) {
        static simulated_flash_t sim;
        boot_flash_t flash;
        boot_metadata_record_t empty = metadata_empty_record();
        boot_metadata_record_t confirmed =
            metadata_confirmed(&empty, BOOT_SLOT_A, 2U);
        boot_metadata_record_t writing =
            metadata_writing(&confirmed, BOOT_SLOT_A, BOOT_SLOT_B, 3U);
        boot_metadata_record_t recovered;

        make_flash(&sim, &flash);
        expect_metadata_status(
            "commit confirmed before injected failure",
            BOOT_METADATA_OK,
            boot_metadata_commit(&flash, &confirmed)
        );

        simulated_flash_fail_after(&sim, operation);
        expect_metadata_status(
            "commit with injected failure",
            BOOT_METADATA_ERR_FLASH,
            boot_metadata_commit(&flash, &writing)
        );
        expect_metadata_status(
            "recover after injected failure",
            BOOT_METADATA_OK,
            boot_metadata_recover_from_flash(&flash, &recovered, NULL)
        );

        if (operation <= 8U) {
            expect_metadata_record(
                "pre-commit-marker failure preserves confirmed copy",
                &recovered,
                1U,
                BOOT_METADATA_STATE_CONFIRMED,
                BOOT_SLOT_A,
                BOOT_SLOT_NONE,
                2U
            );
        } else {
            expect_metadata_record(
                "post-commit-marker failure recovers committed copy",
                &recovered,
                2U,
                BOOT_METADATA_STATE_WRITING,
                BOOT_SLOT_A,
                BOOT_SLOT_B,
                3U
            );
        }
    }
}

static void test_update_package_parse_and_verify_security_cases(void)
{
    uint8_t package[TEST_PACKAGE_BUFFER_SIZE];
    uint8_t mutated[TEST_PACKAGE_BUFFER_SIZE];
    uint8_t wrong_public_key[FIRMWARE_PUBLIC_KEY_SIZE];
    uint8_t wrong_secret_key[64];
    uint8_t wrong_seed[32];
    const boot_slot_descriptor_t *slot_b = NULL;
    const boot_slot_descriptor_t *slot_a = NULL;
    update_package_t parsed;
    verify_status_t verify_status = VERIFY_BAD_PAYLOAD_RANGE;

    for (uint32_t i = 0U; i < sizeof(wrong_seed); ++i) {
        wrong_seed[i] = (uint8_t)(0x55U + i);
    }
    crypto_ed25519_key_pair(wrong_secret_key, wrong_public_key, wrong_seed);

    expect_u32(
        "lookup slot B for package tests",
        BOOT_SLOT_LOOKUP_OK,
        boot_slot_lookup(BOOT_SLOT_B, &slot_b)
    );
    expect_u32(
        "lookup slot A for package tests",
        BOOT_SLOT_LOOKUP_OK,
        boot_slot_lookup(BOOT_SLOT_A, &slot_a)
    );

