Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
    const size_t package_size =
        build_update_package_for_slot(BOOT_SLOT_B, 3U, package, sizeof(package));

    expect_package_status(
        "valid update package",
        UPDATE_PACKAGE_OK,
        update_package_verify_for_slot(
            package,
            package_size,
            update_public_key,
            slot_b,
            &parsed,
            &verify_status
        )
    );
    expect_verify_status("valid update package verifier", VERIFY_OK, verify_status);
    expect_u32("parsed package payload", TEST_UPDATE_PAYLOAD_SIZE, (uint32_t)parsed.payload_size);

    expect_package_status(
        "wrong key rejected",
        UPDATE_PACKAGE_ERR_VERIFY,
        update_package_verify_for_slot(
            package,
            package_size,
            wrong_public_key,
            slot_b,
            NULL,
            &verify_status
        )
    );
    expect_verify_status("wrong key verify status", VERIFY_BAD_SIGNATURE, verify_status);

    memcpy(mutated, package, package_size);
    mutated[package_size - 1U] ^= 0x01U;
    expect_package_status(
        "modified payload rejected",
        UPDATE_PACKAGE_ERR_VERIFY,
        update_package_verify_for_slot(
            mutated,
            package_size,
            update_public_key,
            slot_b,
            NULL,
            &verify_status
        )
    );
    expect_verify_status(
        "modified payload verify status",
        VERIFY_BAD_PAYLOAD_HASH,
        verify_status
    );

    memcpy(mutated, package, package_size);
    test_store_le32(&mutated[offsetof(signed_manifest_t, image_version)], 4U);
    expect_package_status(
        "modified authenticated manifest rejected",
        UPDATE_PACKAGE_ERR_VERIFY,
        update_package_verify_for_slot(
            mutated,
            package_size,
            update_public_key,
            slot_b,
            NULL,
            &verify_status
        )
    );
    expect_verify_status(
        "modified manifest verify status",
        VERIFY_BAD_SIGNATURE,
        verify_status
    );

    memcpy(mutated, package, package_size);
    test_store_le32(&mutated[offsetof(signed_manifest_t, flags)], 1U);
    sign_package_manifest(mutated);
    expect_package_status(
        "unknown flags rejected",
        UPDATE_PACKAGE_ERR_UNKNOWN_FLAGS,
        update_package_parse(mutated, package_size, &parsed)
    );

    memcpy(mutated, package, package_size);
    test_store_le32(
        &mutated[offsetof(signed_manifest_t, header_version)],
        UPDATE_PACKAGE_FORMAT_VERSION + 1UL
    );
    sign_package_manifest(mutated);
    expect_package_status(
        "unsupported package version rejected",
        UPDATE_PACKAGE_ERR_UNSUPPORTED_VERSION,
        update_package_parse(mutated, package_size, &parsed)
    );

    expect_package_status(
        "truncated package rejected",
        UPDATE_PACKAGE_ERR_TRUNCATED,
        update_package_parse(package, package_size - 1U, &parsed)
    );

    memcpy(mutated, package, package_size);
    mutated[package_size] = 0xFFU;
    expect_package_status(
        "trailing package data rejected",
        UPDATE_PACKAGE_ERR_TRAILING_DATA,
        update_package_parse(mutated, package_size + 1U, &parsed)
    );

    memcpy(mutated, package, package_size);
    test_store_le32(
        &mutated[offsetof(signed_manifest_t, image_size)],
        STM32F429_SLOT_B_PAYLOAD_MAX_SIZE + 1UL
    );
    sign_package_manifest(mutated);
    expect_package_status(
        "oversized package rejected",
        UPDATE_PACKAGE_ERR_OVERSIZED,
        update_package_parse(mutated, package_size, &parsed)
    );

    memcpy(mutated, package, package_size);
    test_store_le32(&mutated[offsetof(signed_manifest_t, image_size)], 0U);
    sign_package_manifest(mutated);
    expect_package_status(
        "zero payload rejected",
        UPDATE_PACKAGE_ERR_BAD_SIZE,
        update_package_parse(mutated, package_size, &parsed)
    );

    memcpy(mutated, package, package_size);
    test_store_le32(&mutated[offsetof(signed_manifest_t, image_size)], UINT32_MAX);
    sign_package_manifest(mutated);
    expect_package_status(
        "address arithmetic overflow sized package rejected",
        UPDATE_PACKAGE_ERR_OVERSIZED,
        update_package_parse(mutated, package_size, &parsed)
    );

    memcpy(mutated, package, package_size);
    test_store_le32(
        &mutated[offsetof(signed_manifest_t, reserved0)],
        UPDATE_PACKAGE_TARGET_STM32F429IGT6_AB_V1 + 1UL
    );
    sign_package_manifest(mutated);
    expect_package_status(
        "bad target compatibility rejected",
        UPDATE_PACKAGE_ERR_BAD_TARGET,
        update_package_parse(mutated, package_size, &parsed)
    );

    memcpy(mutated, package, package_size);
    test_store_le32(
        &mutated[offsetof(signed_manifest_t, reserved1)],
        UPDATE_PACKAGE_IMAGE_TYPE_APPLICATION + 1UL
    );
    sign_package_manifest(mutated);
    expect_package_status(
        "bad image type rejected",
        UPDATE_PACKAGE_ERR_BAD_IMAGE_TYPE,
        update_package_parse(mutated, package_size, &parsed)
    );

    memcpy(mutated, package, package_size);
    mutated[SIGNED_MANIFEST_SIZE + SIGNED_SIGNATURE_SIZE] = 0x00U;
    expect_package_status(
        "bad padding rejected",
        UPDATE_PACKAGE_ERR_BAD_PADDING,
        update_package_parse(mutated, package_size, &parsed)
    );

    expect_package_status(
        "package for inactive slot only",
        UPDATE_PACKAGE_ERR_INCOMPATIBLE_SLOT,
        update_package_verify_for_slot(
            package,
            package_size,
            update_public_key,
            slot_a,
            NULL,
            &verify_status
        )
    );

    memcpy(mutated, package, package_size);
    test_store_le32(&mutated[SIGNED_IMAGE_HEADER_SIZE], APPLICATION_MSP_BASE);
    refresh_package_hash_and_signature(mutated);
    expect_package_status(
        "invalid MSP rejected",
        UPDATE_PACKAGE_ERR_VERIFY,
        update_package_verify_for_slot(
            mutated,
            package_size,
            update_public_key,
            slot_b,
            NULL,
            &verify_status
        )
    );
    expect_verify_status("invalid MSP verify status", VERIFY_BAD_STACK, verify_status);

    memcpy(mutated, package, package_size);
    test_store_le32(
        &mutated[SIGNED_IMAGE_HEADER_SIZE + 4U],
        slot_b->signed_image_base | 1UL
    );
    refresh_package_hash_and_signature(mutated);
    expect_package_status(
        "reset before payload rejected",
        UPDATE_PACKAGE_ERR_VERIFY,
        update_package_verify_for_slot(
            mutated,
            package_size,
            update_public_key,
            slot_b,
            NULL,
            &verify_status
        )
    );
    expect_verify_status(
        "reset before payload verify status",
        VERIFY_BAD_RESET_VECTOR,
        verify_status
    );

    memcpy(mutated, package, package_size);
    test_store_le32(
        &mutated[SIGNED_IMAGE_HEADER_SIZE + 4U],
        (slot_b->payload_base + TEST_UPDATE_PAYLOAD_SIZE) | 1UL
    );
    refresh_package_hash_and_signature(mutated);
    expect_package_status(
        "reset outside payload rejected",
        UPDATE_PACKAGE_ERR_VERIFY,
        update_package_verify_for_slot(
            mutated,
            package_size,
            update_public_key,
            slot_b,
            NULL,
            &verify_status
        )
    );
    expect_verify_status(
        "reset outside payload verify status",
        VERIFY_BAD_RESET_VECTOR,
        verify_status
    );
}

static void test_update_installer_success_to_candidate_ready(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    const boot_slot_descriptor_t *active = NULL;
    const boot_slot_descriptor_t *candidate = NULL;
    uint8_t package[TEST_PACKAGE_BUFFER_SIZE];
    uint8_t program_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t readback_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t installed_buffer[TEST_PACKAGE_BUFFER_SIZE];
    update_install_result_t result;
    boot_metadata_record_t recovered;
    update_package_t installed;
    verify_status_t verify_status = VERIFY_BAD_PAYLOAD_RANGE;

    const size_t package_size = setup_standard_install(
        &sim,
        &flash,
        BOOT_SLOT_A,
        2U,
        3U,
        package,
        sizeof(package),
        &active,
        &candidate
    );

    update_install_options_t options = make_install_options(
        program_buffer,
        readback_buffer,
        installed_buffer,
        NULL,
        NULL
    );

    expect_install_status(
        "install valid package",
        UPDATE_INSTALL_OK,
        update_installer_install(
            &flash,
            package,
            package_size,
            update_public_key,
            &options,
            &result
        )
    );
    expect_u32("install active slot", BOOT_SLOT_A, result.active_slot);
    expect_u32("install candidate slot", BOOT_SLOT_B, result.candidate_slot);
    expect_u32("install image version", 3U, result.image_version);
    expect_u32(
        "all inactive sectors erased",
        candidate->last_sector - candidate->first_sector + 1UL,
        result.erased_sector_count
    );
    expect_u32("program blocks", 6U, result.programmed_block_count);
    expect_verify_status("package preverify", VERIFY_OK, result.package_verify_status);
    expect_verify_status("installed verify", VERIFY_OK, result.installed_verify_status);

    expect_metadata_status(
        "recover candidate ready",
        BOOT_METADATA_OK,
        boot_metadata_recover_from_flash(&flash, &recovered, NULL)
    );
    expect_metadata_record(
        "candidate ready metadata",
        &recovered,
        3U,
        BOOT_METADATA_STATE_CANDIDATE_READY,
        BOOT_SLOT_A,
        BOOT_SLOT_B,
        3U
    );

    expect_package_status(
        "installed bytes verify",
        UPDATE_PACKAGE_OK,
        update_package_verify_for_slot(
            &sim.storage[flash_offset(candidate->signed_image_base)],
            package_size,
            update_public_key,
            candidate,
            &installed,
            &verify_status
        )
    );
    expect_verify_status("installed bytes verifier", VERIFY_OK, verify_status);
    expect_protected_regions_unchanged(&sim, active);
    expect_no_forbidden_writes(&sim, active);
}

static void test_update_installer_uses_opposite_inactive_slot(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    const boot_slot_descriptor_t *active = NULL;
    const boot_slot_descriptor_t *candidate = NULL;
    uint8_t package[TEST_PACKAGE_BUFFER_SIZE];
    uint8_t program_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t readback_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t installed_buffer[TEST_PACKAGE_BUFFER_SIZE];
    update_install_result_t result;

    const size_t package_size = setup_standard_install(
        &sim,
        &flash,
        BOOT_SLOT_B,
        2U,
        3U,
        package,
        sizeof(package),
        &active,
        &candidate
    );
    update_install_options_t options = make_install_options(
        program_buffer,
        readback_buffer,
        installed_buffer,
        NULL,
        NULL
    );

    expect_install_status(
        "install to slot A when B active",
        UPDATE_INSTALL_OK,
        update_installer_install(
            &flash,
            package,
            package_size,
            update_public_key,
            &options,
            &result
        )
    );
    expect_u32("slot B remained active", BOOT_SLOT_B, result.active_slot);
    expect_u32("slot A selected as candidate", BOOT_SLOT_A, result.candidate_slot);
    expect_protected_regions_unchanged(&sim, active);
    expect_no_forbidden_writes(&sim, active);
}

static void test_update_installer_rejects_rollback_and_active_slot_package(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    const boot_slot_descriptor_t *active = NULL;
    const boot_slot_descriptor_t *candidate = NULL;
    uint8_t package[TEST_PACKAGE_BUFFER_SIZE];
    uint8_t program_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t readback_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t installed_buffer[TEST_PACKAGE_BUFFER_SIZE];

    size_t package_size = setup_standard_install(
        &sim,
        &flash,
        BOOT_SLOT_A,
        3U,
        2U,
        package,
        sizeof(package),
        &active,
        &candidate
    );
    update_install_options_t options = make_install_options(
        program_buffer,
        readback_buffer,
        installed_buffer,
        NULL,
        NULL
    );
    expect_install_status(
        "rollback package rejected",
        UPDATE_INSTALL_ERR_ROLLBACK,
        update_installer_install(
            &flash,
            package,
            package_size,
            update_public_key,
            &options,
            NULL
        )
    );
    expect_install_failure_invariants(&sim, &flash, active);

