Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
    package_size = setup_standard_install(
        &sim,
        &flash,
        BOOT_SLOT_A,
        2U,
        3U,
        package,
        sizeof(package),
        &active,
        &candidate
    );
    (void)candidate;
    package_size = build_update_package_for_slot(
        BOOT_SLOT_A,
        3U,
        package,
        sizeof(package)
    );
    prepare_protected_snapshots(&sim, active);
    expect_install_status(
        "active-slot package rejected",
        UPDATE_INSTALL_ERR_PACKAGE,
        update_installer_install(
            &flash,
            package,
            package_size,
            update_public_key,
            &options,
            NULL
        )
    );
    expect_install_failure_invariants(&sim, &flash, active);
}

static void test_update_installer_rejects_bad_metadata_states(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    const boot_slot_descriptor_t *active = NULL;
    boot_metadata_record_t recovered;
    uint8_t package[TEST_PACKAGE_BUFFER_SIZE];
    uint8_t program_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t readback_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t installed_buffer[TEST_PACKAGE_BUFFER_SIZE];
    uint8_t copy_a[STM32F429_BOOT_METADATA_RECORD_SIZE];
    uint8_t copy_b[STM32F429_BOOT_METADATA_RECORD_SIZE];

    make_installer_flash(&sim, &flash);
    expect_u32(
        "lookup active for invalid metadata",
        BOOT_SLOT_LOOKUP_OK,
        boot_slot_lookup(BOOT_SLOT_A, &active)
    );
    prepare_protected_snapshots(&sim, active);
    const size_t package_size =
        build_update_package_for_slot(BOOT_SLOT_B, 3U, package, sizeof(package));
    update_install_options_t options = make_install_options(
        program_buffer,
        readback_buffer,
        installed_buffer,
        NULL,
        NULL
    );

    expect_install_status(
        "both metadata copies invalid",
        UPDATE_INSTALL_ERR_METADATA,
        update_installer_install(
            &flash,
            package,
            package_size,
            update_public_key,
            &options,
            NULL
        )
    );
    expect_no_forbidden_writes(&sim, active);

    boot_metadata_record_t empty = metadata_empty_record();
    boot_metadata_record_t confirmed_a =
        metadata_confirmed(&empty, BOOT_SLOT_A, 2U);
    boot_metadata_record_t confirmed_b = confirmed_a;
    confirmed_b.active_slot = BOOT_SLOT_B;
    expect_metadata_status(
        "encode ambiguous A",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed_a, copy_a)
    );
    expect_metadata_status(
        "encode ambiguous B",
        BOOT_METADATA_OK,
        boot_metadata_encode(&confirmed_b, copy_b)
    );
    memcpy(&sim.storage[flash_offset(STM32F429_BOOT_METADATA_A_BASE)], copy_a, sizeof(copy_a));
    memcpy(&sim.storage[flash_offset(STM32F429_BOOT_METADATA_B_BASE)], copy_b, sizeof(copy_b));
    sim.write_log_count = 0U;
    expect_install_status(
        "ambiguous active-slot state rejected",
        UPDATE_INSTALL_ERR_METADATA,
        update_installer_install(
            &flash,
            package,
            package_size,
            update_public_key,
            &options,
            NULL
        )
    );
    expect_metadata_status(
        "ambiguous metadata remains ambiguous",
        BOOT_METADATA_ERR_AMBIGUOUS,
        boot_metadata_recover_from_flash(&flash, &recovered, NULL)
    );
    expect_no_forbidden_writes(&sim, active);
}

static void run_install_with_hook_failure(
    const char *name,
    update_install_fault_point_t point,
    uint32_t detail,
    uint8_t match_detail
)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    const boot_slot_descriptor_t *active = NULL;
    const boot_slot_descriptor_t *candidate = NULL;
    uint8_t package[TEST_PACKAGE_BUFFER_SIZE];
    uint8_t program_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t readback_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t installed_buffer[TEST_PACKAGE_BUFFER_SIZE];
    install_fault_config_t fault = {point, detail, match_detail};

    const size_t package_size = setup_standard_install(
        &sim,
        &flash,
        BOOT_SLOT_A,
        2U,
        3U,
        package,
        sizeof(package),
        &active,
        &candidate
    );
    (void)candidate;
    update_install_options_t options = make_install_options(
        program_buffer,
        readback_buffer,
        installed_buffer,
        install_fault_hook,
        &fault
    );

    expect_install_status(
        name,
        UPDATE_INSTALL_ERR_INJECTED,
        update_installer_install(
            &flash,
            package,
            package_size,
            update_public_key,
            &options,
            NULL
        )
    );
    expect_install_failure_invariants(&sim, &flash, active);
}

static void test_update_installer_logical_failure_injection(void)
{
    run_install_with_hook_failure(
        "metadata WRITING transition injection",
        UPDATE_INSTALL_FAULT_METADATA_WRITING,
        0U,
        0U
    );
    run_install_with_hook_failure(
        "first program block injection",
        UPDATE_INSTALL_FAULT_PROGRAM_BLOCK,
        0U,
        1U
    );
    run_install_with_hook_failure(
        "middle program block injection",
        UPDATE_INSTALL_FAULT_PROGRAM_BLOCK,
        2U,
        1U
    );
    run_install_with_hook_failure(
        "final program block injection",
        UPDATE_INSTALL_FAULT_PROGRAM_BLOCK,
        5U,
        1U
    );
    run_install_with_hook_failure(
        "installer readback injection",
        UPDATE_INSTALL_FAULT_READBACK,
        0U,
        1U
    );
    run_install_with_hook_failure(
        "complete hash injection",
        UPDATE_INSTALL_FAULT_HASH_COMPLETE,
        3U,
        1U
    );
    run_install_with_hook_failure(
        "production verifier invocation injection",
        UPDATE_INSTALL_FAULT_VERIFY_INSTALLED,
        3U,
        1U
    );
    run_install_with_hook_failure(
        "candidate-ready metadata transition injection",
        UPDATE_INSTALL_FAULT_METADATA_CANDIDATE_READY,
        3U,
        1U
    );
}

static void test_update_installer_flash_failure_injection(void)
{
    for (uint32_t sector = STM32F429_SLOT_B_FIRST_SECTOR;
         sector <= STM32F429_SLOT_B_LAST_SECTOR;
         ++sector) {
        static simulated_flash_t sim;
        boot_flash_t flash;
        const boot_slot_descriptor_t *active = NULL;
        const boot_slot_descriptor_t *candidate = NULL;
        uint8_t package[TEST_PACKAGE_BUFFER_SIZE];
        uint8_t program_buffer[TEST_INSTALL_PROGRAM_CHUNK];
        uint8_t readback_buffer[TEST_INSTALL_PROGRAM_CHUNK];
        uint8_t installed_buffer[TEST_PACKAGE_BUFFER_SIZE];

        const size_t package_size = setup_standard_install(
            &sim,
            &flash,
            BOOT_SLOT_A,
            2U,
            3U,
            package,
            sizeof(package),
            &active,
            &candidate
        );
        (void)candidate;
        simulated_flash_fail_before_erase_sector(&sim, sector);
        update_install_options_t options = make_install_options(
            program_buffer,
            readback_buffer,
            installed_buffer,
            NULL,
            NULL
        );
        expect_install_status(
            "inactive sector erase failure",
            UPDATE_INSTALL_ERR_ERASE,
            update_installer_install(
                &flash,
                package,
                package_size,
                update_public_key,
                &options,
                NULL
            )
        );
        expect_install_failure_invariants(&sim, &flash, active);
    }

