Zimbo88/stm32-security-lab/tests/update_storage/test_update_storage.c
    return UPDATE_INSTALL_OK;
}

typedef struct {
    simulated_flash_t *sim;
    uint32_t corrupt_address;
} corrupt_hash_read_context_t;

static update_install_status_t corrupt_hash_read_hook(
    void *context,
    update_install_fault_point_t point,
    uint32_t detail
)
{
    corrupt_hash_read_context_t *config =
        (corrupt_hash_read_context_t *)context;

    if ((config != NULL) &&
        (point == UPDATE_INSTALL_FAULT_HASH_BEGIN)) {
        (void)detail;
        simulated_flash_corrupt_read_address(config->sim, config->corrupt_address);
    }

    return UPDATE_INSTALL_OK;
}

static update_install_status_t corrupt_installed_verify_hook(
    void *context,
    update_install_fault_point_t point,
    uint32_t detail
)
{
    uint8_t *installed_buffer = (uint8_t *)context;
    (void)detail;

    if ((installed_buffer != NULL) &&
        (point == UPDATE_INSTALL_FAULT_VERIFY_INSTALLED)) {
        installed_buffer[SIGNED_MANIFEST_SIZE] ^= 0x01U;
    }

    return UPDATE_INSTALL_OK;
}

static void test_update_installer_detects_final_hash_mismatch(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    const boot_slot_descriptor_t *active = NULL;
    const boot_slot_descriptor_t *candidate = NULL;
    uint8_t package[TEST_PACKAGE_BUFFER_SIZE];
    uint8_t program_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t readback_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t installed_buffer[TEST_PACKAGE_BUFFER_SIZE];

    const size_t package_size = setup_standard_install(
        &sim,
        &flash,
        BOOT_SLOT_A,
        2U,
        3U,
        package,
        sizeof(package),
        &active,
        &candidate
    );
    corrupt_hash_read_context_t context = {
        .sim = &sim,
        .corrupt_address = candidate->payload_base,
    };
    update_install_options_t options = make_install_options(
        program_buffer,
        readback_buffer,
        installed_buffer,
        corrupt_hash_read_hook,
        &context
    );
    expect_install_status(
        "final hash mismatch",
        UPDATE_INSTALL_ERR_HASH,
        update_installer_install(
            &flash,
            package,
            package_size,
            update_public_key,
            &options,
            NULL
        )
    );
    expect_install_failure_invariants(&sim, &flash, active);
}

static void test_update_installer_detects_verifier_failure_after_programming(void)
{
    simulated_flash_t sim;
    boot_flash_t flash;
    const boot_slot_descriptor_t *active = NULL;
    const boot_slot_descriptor_t *candidate = NULL;
    uint8_t package[TEST_PACKAGE_BUFFER_SIZE];
    uint8_t program_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t readback_buffer[TEST_INSTALL_PROGRAM_CHUNK];
    uint8_t installed_buffer[TEST_PACKAGE_BUFFER_SIZE];

    const size_t package_size = setup_standard_install(
        &sim,
        &flash,
        BOOT_SLOT_A,
        2U,
        3U,
        package,
        sizeof(package),
        &active,
        &candidate
    );
    (void)candidate;
    update_install_options_t options = make_install_options(
        program_buffer,
        readback_buffer,
        installed_buffer,
        corrupt_installed_verify_hook,
        installed_buffer
    );
    expect_install_status(
        "verifier failure after programming",
        UPDATE_INSTALL_ERR_INSTALLED_VERIFY,
        update_installer_install(
            &flash,
            package,
            package_size,
            update_public_key,
            &options,
            NULL
        )
    );
    expect_install_failure_invariants(&sim, &flash, active);
}

int main(void)
{
    init_update_keys();

    test_sector_lookup_and_bounds();
    test_allowed_erase_policy();
    test_target_flash_stub_fails_closed();
    test_program_alignment_bounds_and_readback();
    test_read_rejects_address_overflow_before_backend();
    test_readback_verification_failure_is_reported();
    test_failure_injection_is_visible();
    test_flash_init_rejects_invalid_policy();
    test_metadata_encode_decode_and_recovery();
    test_metadata_rejects_noncanonical_records();
    test_metadata_identical_sequence_is_deterministic();
    test_metadata_ambiguous_and_sequence_handling();
    test_metadata_state_transitions();
    test_metadata_flash_commit_and_recovery();
    test_metadata_power_loss_during_copy_write_keeps_previous_copy();
    test_metadata_uncommitted_record_is_not_selected();
    test_metadata_commit_failure_boundaries_are_deterministic();
    test_update_package_parse_and_verify_security_cases();
    test_update_installer_success_to_candidate_ready();
    test_update_installer_uses_opposite_inactive_slot();
    test_update_installer_rejects_rollback_and_active_slot_package();
    test_update_installer_rejects_bad_metadata_states();
    test_update_installer_logical_failure_injection();
    test_update_installer_flash_failure_injection();
    test_update_installer_detects_post_program_corruption();
    test_update_installer_detects_final_hash_mismatch();
    test_update_installer_detects_verifier_failure_after_programming();

    if (failures != 0) {
        printf("update storage tests failed: %d\n", failures);
        return 1;
    }

    printf("update storage tests passed\n");
    return 0;
}
